case3/TemplateCase-0.1/system/blockMeshDict
// Parametrized windTunnel

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:

//Mathematical constants:


//m4 spec:


//plane A settlingChamberInlet


//plane B contractionInlet


//plane C testSectionInlet


//plane D diffuserInlet


//plane E fanInlet


//plane F fanOutlet


//plane z:


//spline:


/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
	// front side
	(-0.5 -0.25 0) // Vertex A0 = 0 
	(0.5 -0.25 0) // Vertex B0 = 1 
	(0.5 0.25 0) // Vertex B1 = 2 
	(-0.5 0.25 0) // Vertex A1 = 3 

	// back side	
	(-0.5 -0.25 0.01) // Vertex A3 = 4 
	(0.5 -0.25 0.01) // Vertex B3 = 5 
	(0.5 0.25 0.01) // Vertex B2 = 6 
	(-0.5 0.25 0.01) // Vertex A2 = 7 

);

blocks          
(
    // stenosis domain	
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges           
(
spline 0 3
(
(-5.061560906133942828e-01 -2.401960784313725561e-01 0.000000000000000000e+00)
(-5.122888290664714406e-01 -2.303921568627451122e-01 0.000000000000000000e+00)
(-5.183749517816570451e-01 -2.205882352941176405e-01 0.000000000000000000e+00)
(-5.243913720108377419e-01 -2.107843137254901966e-01 0.000000000000000000e+00)
(-5.303152674113043030e-01 -2.009803921568627527e-01 0.000000000000000000e+00)
(-5.361241666187153143e-01 -1.911764705882352811e-01 0.000000000000000000e+00)
(-5.417960344886783020e-01 -1.813725490196078372e-01 0.000000000000000000e+00)
(-5.473093556836010620e-01 -1.715686274509803932e-01 0.000000000000000000e+00)
(-5.526432162877356058e-01 -1.617647058823529493e-01 0.000000000000000000e+00)
(-5.577773831408251448e-01 -1.519607843137255054e-01 0.000000000000000000e+00)
(-5.626923805894106234e-01 -1.421568627450980338e-01 0.000000000000000000e+00)
(-5.673695643646556874e-01 -1.323529411764705899e-01 0.000000000000000000e+00)
(-5.717911923064441515e-01 -1.225490196078431460e-01 0.000000000000000000e+00)
(-5.759404916654706774e-01 -1.127450980392156743e-01 0.000000000000000000e+00)
(-5.798017227280239938e-01 -1.029411764705882304e-01 0.000000000000000000e+00)
(-5.833602385221119402e-01 -9.313725490196078649e-02 0.000000000000000000e+00)
(-5.866025403784438375e-01 -8.333333333333334259e-02 0.000000000000000000e+00)
(-5.895163291355062229e-01 -7.352941176470589868e-02 0.000000000000000000e+00)
(-5.920905517944954344e-01 -6.372549019607842702e-02 0.000000000000000000e+00)
(-5.943154434471277225e-01 -5.392156862745098311e-02 0.000000000000000000e+00)
(-5.961825643172818934e-01 -4.411764705882353921e-02 0.000000000000000000e+00)
(-5.976848317759601015e-01 -3.431372549019606755e-02 0.000000000000000000e+00)
(-5.988165472081259377e-01 -2.450980392156862364e-02 0.000000000000000000e+00)
(-5.995734176295034468e-01 -1.470588235294117974e-02 0.000000000000000000e+00)
(-5.999525719713365568e-01 -4.901960784313735831e-03 0.000000000000000000e+00)
(-5.999525719713365568e-01 4.901960784313708075e-03 0.000000000000000000e+00)
(-5.995734176295034468e-01 1.470588235294117974e-02 0.000000000000000000e+00)
(-5.988165472081259377e-01 2.450980392156865140e-02 0.000000000000000000e+00)
(-5.976848317759601015e-01 3.431372549019606755e-02 0.000000000000000000e+00)
(-5.961825643172818934e-01 4.411764705882353921e-02 0.000000000000000000e+00)
(-5.943154434471277225e-01 5.392156862745095536e-02 0.000000000000000000e+00)
(-5.920905517944954344e-01 6.372549019607842702e-02 0.000000000000000000e+00)
(-5.895163291355062229e-01 7.352941176470589868e-02 0.000000000000000000e+00)
(-5.866025403784438375e-01 8.333333333333331483e-02 0.000000000000000000e+00)
(-5.833602385221119402e-01 9.313725490196078649e-02 0.000000000000000000e+00)
(-5.798017227280239938e-01 1.029411764705882026e-01 0.000000000000000000e+00)
(-5.759404916654706774e-01 1.127450980392156743e-01 0.000000000000000000e+00)
(-5.717911923064441515e-01 1.225490196078431460e-01 0.000000000000000000e+00)
(-5.673695643646556874e-01 1.323529411764705621e-01 0.000000000000000000e+00)
(-5.626923805894106234e-01 1.421568627450980338e-01 0.000000000000000000e+00)
(-5.577773831408251448e-01 1.519607843137255054e-01 0.000000000000000000e+00)
(-5.526432162877356058e-01 1.617647058823529216e-01 0.000000000000000000e+00)
(-5.473093556836010620e-01 1.715686274509803932e-01 0.000000000000000000e+00)
(-5.417960344886783020e-01 1.813725490196078649e-01 0.000000000000000000e+00)
(-5.361241666187153143e-01 1.911764705882352811e-01 0.000000000000000000e+00)
(-5.303152674113043030e-01 2.009803921568627527e-01 0.000000000000000000e+00)
(-5.243913720108377419e-01 2.107843137254901689e-01 0.000000000000000000e+00)
(-5.183749517816570451e-01 2.205882352941176405e-01 0.000000000000000000e+00)
(-5.122888290664714406e-01 2.303921568627451122e-01 0.000000000000000000e+00)
(-5.061560906133942828e-01 2.401960784313725283e-01 0.000000000000000000e+00)
)
spline 4 7
(
(-5.061560906133942828e-01 -2.401960784313725561e-01 1.000000000000000021e-02)
(-5.122888290664714406e-01 -2.303921568627451122e-01 1.000000000000000021e-02)
(-5.183749517816570451e-01 -2.205882352941176405e-01 1.000000000000000021e-02)
(-5.243913720108377419e-01 -2.107843137254901966e-01 1.000000000000000021e-02)
(-5.303152674113043030e-01 -2.009803921568627527e-01 1.000000000000000021e-02)
(-5.361241666187153143e-01 -1.911764705882352811e-01 1.000000000000000021e-02)
(-5.417960344886783020e-01 -1.813725490196078372e-01 1.000000000000000021e-02)
(-5.473093556836010620e-01 -1.715686274509803932e-01 1.000000000000000021e-02)
(-5.526432162877356058e-01 -1.617647058823529493e-01 1.000000000000000021e-02)
(-5.577773831408251448e-01 -1.519607843137255054e-01 1.000000000000000021e-02)
(-5.626923805894106234e-01 -1.421568627450980338e-01 1.000000000000000021e-02)
(-5.673695643646556874e-01 -1.323529411764705899e-01 1.000000000000000021e-02)
(-5.717911923064441515e-01 -1.225490196078431460e-01 1.000000000000000021e-02)
(-5.759404916654706774e-01 -1.127450980392156743e-01 1.000000000000000021e-02)
(-5.798017227280239938e-01 -1.029411764705882304e-01 1.000000000000000021e-02)
(-5.833602385221119402e-01 -9.313725490196078649e-02 1.000000000000000021e-02)
(-5.866025403784438375e-01 -8.333333333333334259e-02 1.000000000000000021e-02)
(-5.895163291355062229e-01 -7.352941176470589868e-02 1.000000000000000021e-02)
(-5.920905517944954344e-01 -6.372549019607842702e-02 1.000000000000000021e-02)
(-5.943154434471277225e-01 -5.392156862745098311e-02 1.000000000000000021e-02)
(-5.961825643172818934e-01 -4.411764705882353921e-02 1.000000000000000021e-02)
(-5.976848317759601015e-01 -3.431372549019606755e-02 1.000000000000000021e-02)
(-5.988165472081259377e-01 -2.450980392156862364e-02 1.000000000000000021e-02)
(-5.995734176295034468e-01 -1.470588235294117974e-02 1.000000000000000021e-02)
(-5.999525719713365568e-01 -4.901960784313735831e-03 1.000000000000000021e-02)
(-5.999525719713365568e-01 4.901960784313708075e-03 1.000000000000000021e-02)
(-5.995734176295034468e-01 1.470588235294117974e-02 1.000000000000000021e-02)
(-5.988165472081259377e-01 2.450980392156865140e-02 1.000000000000000021e-02)
(-5.976848317759601015e-01 3.431372549019606755e-02 1.000000000000000021e-02)
(-5.961825643172818934e-01 4.411764705882353921e-02 1.000000000000000021e-02)
(-5.943154434471277225e-01 5.392156862745095536e-02 1.000000000000000021e-02)
(-5.920905517944954344e-01 6.372549019607842702e-02 1.000000000000000021e-02)
(-5.895163291355062229e-01 7.352941176470589868e-02 1.000000000000000021e-02)
(-5.866025403784438375e-01 8.333333333333331483e-02 1.000000000000000021e-02)
(-5.833602385221119402e-01 9.313725490196078649e-02 1.000000000000000021e-02)
(-5.798017227280239938e-01 1.029411764705882026e-01 1.000000000000000021e-02)
(-5.759404916654706774e-01 1.127450980392156743e-01 1.000000000000000021e-02)
(-5.717911923064441515e-01 1.225490196078431460e-01 1.000000000000000021e-02)
(-5.673695643646556874e-01 1.323529411764705621e-01 1.000000000000000021e-02)
(-5.626923805894106234e-01 1.421568627450980338e-01 1.000000000000000021e-02)
(-5.577773831408251448e-01 1.519607843137255054e-01 1.000000000000000021e-02)
(-5.526432162877356058e-01 1.617647058823529216e-01 1.000000000000000021e-02)
(-5.473093556836010620e-01 1.715686274509803932e-01 1.000000000000000021e-02)
(-5.417960344886783020e-01 1.813725490196078649e-01 1.000000000000000021e-02)
(-5.361241666187153143e-01 1.911764705882352811e-01 1.000000000000000021e-02)
(-5.303152674113043030e-01 2.009803921568627527e-01 1.000000000000000021e-02)
(-5.243913720108377419e-01 2.107843137254901689e-01 1.000000000000000021e-02)
(-5.183749517816570451e-01 2.205882352941176405e-01 1.000000000000000021e-02)
(-5.122888290664714406e-01 2.303921568627451122e-01 1.000000000000000021e-02)
(-5.061560906133942828e-01 2.401960784313725283e-01 1.000000000000000021e-02)
)
spline 1 2
(
(5.061560906133942828e-01 -2.401960784313725561e-01 0.000000000000000000e+00)
(5.122888290664714406e-01 -2.303921568627451122e-01 0.000000000000000000e+00)
(5.183749517816570451e-01 -2.205882352941176405e-01 0.000000000000000000e+00)
(5.243913720108377419e-01 -2.107843137254901966e-01 0.000000000000000000e+00)
(5.303152674113043030e-01 -2.009803921568627527e-01 0.000000000000000000e+00)
(5.361241666187153143e-01 -1.911764705882352811e-01 0.000000000000000000e+00)
(5.417960344886783020e-01 -1.813725490196078372e-01 0.000000000000000000e+00)
(5.473093556836010620e-01 -1.715686274509803932e-01 0.000000000000000000e+00)
(5.526432162877356058e-01 -1.617647058823529493e-01 0.000000000000000000e+00)
(5.577773831408251448e-01 -1.519607843137255054e-01 0.000000000000000000e+00)
(5.626923805894106234e-01 -1.421568627450980338e-01 0.000000000000000000e+00)
(5.673695643646556874e-01 -1.323529411764705899e-01 0.000000000000000000e+00)
(5.717911923064441515e-01 -1.225490196078431460e-01 0.000000000000000000e+00)
(5.759404916654706774e-01 -1.127450980392156743e-01 0.000000000000000000e+00)
(5.798017227280239938e-01 -1.029411764705882304e-01 0.000000000000000000e+00)
(5.833602385221119402e-01 -9.313725490196078649e-02 0.000000000000000000e+00)
(5.866025403784438375e-01 -8.333333333333334259e-02 0.000000000000000000e+00)
(5.895163291355062229e-01 -7.352941176470589868e-02 0.000000000000000000e+00)
(5.920905517944954344e-01 -6.372549019607842702e-02 0.000000000000000000e+00)
(5.943154434471277225e-01 -5.392156862745098311e-02 0.000000000000000000e+00)
(5.961825643172818934e-01 -4.411764705882353921e-02 0.000000000000000000e+00)
(5.976848317759601015e-01 -3.431372549019606755e-02 0.000000000000000000e+00)
(5.988165472081259377e-01 -2.450980392156862364e-02 0.000000000000000000e+00)
(5.995734176295034468e-01 -1.470588235294117974e-02 0.000000000000000000e+00)
(5.999525719713365568e-01 -4.901960784313735831e-03 0.000000000000000000e+00)
(5.999525719713365568e-01 4.901960784313708075e-03 0.000000000000000000e+00)
(5.995734176295034468e-01 1.470588235294117974e-02 0.000000000000000000e+00)
(5.988165472081259377e-01 2.450980392156865140e-02 0.000000000000000000e+00)
(5.976848317759601015e-01 3.431372549019606755e-02 0.000000000000000000e+00)
(5.961825643172818934e-01 4.411764705882353921e-02 0.000000000000000000e+00)
(5.943154434471277225e-01 5.392156862745095536e-02 0.000000000000000000e+00)
(5.920905517944954344e-01 6.372549019607842702e-02 0.000000000000000000e+00)
(5.895163291355062229e-01 7.352941176470589868e-02 0.000000000000000000e+00)
(5.866025403784438375e-01 8.333333333333331483e-02 0.000000000000000000e+00)
(5.833602385221119402e-01 9.313725490196078649e-02 0.000000000000000000e+00)
(5.798017227280239938e-01 1.029411764705882026e-01 0.000000000000000000e+00)
(5.759404916654706774e-01 1.127450980392156743e-01 0.000000000000000000e+00)
(5.717911923064441515e-01 1.225490196078431460e-01 0.000000000000000000e+00)
(5.673695643646556874e-01 1.323529411764705621e-01 0.000000000000000000e+00)
(5.626923805894106234e-01 1.421568627450980338e-01 0.000000000000000000e+00)
(5.577773831408251448e-01 1.519607843137255054e-01 0.000000000000000000e+00)
(5.526432162877356058e-01 1.617647058823529216e-01 0.000000000000000000e+00)
(5.473093556836010620e-01 1.715686274509803932e-01 0.000000000000000000e+00)
(5.417960344886783020e-01 1.813725490196078649e-01 0.000000000000000000e+00)
(5.361241666187153143e-01 1.911764705882352811e-01 0.000000000000000000e+00)
(5.303152674113043030e-01 2.009803921568627527e-01 0.000000000000000000e+00)
(5.243913720108377419e-01 2.107843137254901689e-01 0.000000000000000000e+00)
(5.183749517816570451e-01 2.205882352941176405e-01 0.000000000000000000e+00)
(5.122888290664714406e-01 2.303921568627451122e-01 0.000000000000000000e+00)
(5.061560906133942828e-01 2.401960784313725283e-01 0.000000000000000000e+00)
)
spline 5 6
(
(5.061560906133942828e-01 -2.401960784313725561e-01 1.000000000000000021e-02)
(5.122888290664714406e-01 -2.303921568627451122e-01 1.000000000000000021e-02)
(5.183749517816570451e-01 -2.205882352941176405e-01 1.000000000000000021e-02)
(5.243913720108377419e-01 -2.107843137254901966e-01 1.000000000000000021e-02)
(5.303152674113043030e-01 -2.009803921568627527e-01 1.000000000000000021e-02)
(5.361241666187153143e-01 -1.911764705882352811e-01 1.000000000000000021e-02)
(5.417960344886783020e-01 -1.813725490196078372e-01 1.000000000000000021e-02)
(5.473093556836010620e-01 -1.715686274509803932e-01 1.000000000000000021e-02)
(5.526432162877356058e-01 -1.617647058823529493e-01 1.000000000000000021e-02)
(5.577773831408251448e-01 -1.519607843137255054e-01 1.000000000000000021e-02)
(5.626923805894106234e-01 -1.421568627450980338e-01 1.000000000000000021e-02)
(5.673695643646556874e-01 -1.323529411764705899e-01 1.000000000000000021e-02)
(5.717911923064441515e-01 -1.225490196078431460e-01 1.000000000000000021e-02)
(5.759404916654706774e-01 -1.127450980392156743e-01 1.000000000000000021e-02)
(5.798017227280239938e-01 -1.029411764705882304e-01 1.000000000000000021e-02)
(5.833602385221119402e-01 -9.313725490196078649e-02 1.000000000000000021e-02)
(5.866025403784438375e-01 -8.333333333333334259e-02 1.000000000000000021e-02)
(5.895163291355062229e-01 -7.352941176470589868e-02 1.000000000000000021e-02)
(5.920905517944954344e-01 -6.372549019607842702e-02 1.000000000000000021e-02)
(5.943154434471277225e-01 -5.392156862745098311e-02 1.000000000000000021e-02)
(5.961825643172818934e-01 -4.411764705882353921e-02 1.000000000000000021e-02)
(5.976848317759601015e-01 -3.431372549019606755e-02 1.000000000000000021e-02)
(5.988165472081259377e-01 -2.450980392156862364e-02 1.000000000000000021e-02)
(5.995734176295034468e-01 -1.470588235294117974e-02 1.000000000000000021e-02)
(5.999525719713365568e-01 -4.901960784313735831e-03 1.000000000000000021e-02)
(5.999525719713365568e-01 4.901960784313708075e-03 1.000000000000000021e-02)
(5.995734176295034468e-01 1.470588235294117974e-02 1.000000000000000021e-02)
(5.988165472081259377e-01 2.450980392156865140e-02 1.000000000000000021e-02)
(5.976848317759601015e-01 3.431372549019606755e-02 1.000000000000000021e-02)
(5.961825643172818934e-01 4.411764705882353921e-02 1.000000000000000021e-02)
(5.943154434471277225e-01 5.392156862745095536e-02 1.000000000000000021e-02)
(5.920905517944954344e-01 6.372549019607842702e-02 1.000000000000000021e-02)
(5.895163291355062229e-01 7.352941176470589868e-02 1.000000000000000021e-02)
(5.866025403784438375e-01 8.333333333333331483e-02 1.000000000000000021e-02)
(5.833602385221119402e-01 9.313725490196078649e-02 1.000000000000000021e-02)
(5.798017227280239938e-01 1.029411764705882026e-01 1.000000000000000021e-02)
(5.759404916654706774e-01 1.127450980392156743e-01 1.000000000000000021e-02)
(5.717911923064441515e-01 1.225490196078431460e-01 1.000000000000000021e-02)
(5.673695643646556874e-01 1.323529411764705621e-01 1.000000000000000021e-02)
(5.626923805894106234e-01 1.421568627450980338e-01 1.000000000000000021e-02)
(5.577773831408251448e-01 1.519607843137255054e-01 1.000000000000000021e-02)
(5.526432162877356058e-01 1.617647058823529216e-01 1.000000000000000021e-02)
(5.473093556836010620e-01 1.715686274509803932e-01 1.000000000000000021e-02)
(5.417960344886783020e-01 1.813725490196078649e-01 1.000000000000000021e-02)
(5.361241666187153143e-01 1.911764705882352811e-01 1.000000000000000021e-02)
(5.303152674113043030e-01 2.009803921568627527e-01 1.000000000000000021e-02)
(5.243913720108377419e-01 2.107843137254901689e-01 1.000000000000000021e-02)
(5.183749517816570451e-01 2.205882352941176405e-01 1.000000000000000021e-02)
(5.122888290664714406e-01 2.303921568627451122e-01 1.000000000000000021e-02)
(5.061560906133942828e-01 2.401960784313725283e-01 1.000000000000000021e-02)
)
);




boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
    	type patch;
    	faces
    	(
    		(2 6 5 1)
    	);
    }

    up
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    down
    {
        type patch;
        faces
        (
            //(0 4 7 3)
            //(2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);