case3/TemplateCase-0.1/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.492852 -0.245366 0.005)
(-0.472736 -0.245366 0.005)
(-0.452619 -0.245366 0.005)
(-0.432503 -0.245366 0.005)
(-0.412386 -0.245366 0.005)
(-0.39227 -0.245366 0.005)
(-0.372154 -0.245366 0.005)
(-0.352037 -0.245366 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.502905 -0.245375 0.005)
(-0.508707 -0.236119 0.005)
(-0.514489 -0.22685 0.005)
(-0.520235 -0.217558 0.005)
(-0.525931 -0.208235 0.005)
(-0.531561 -0.198873 0.005)
(-0.537111 -0.189462 0.005)
(-0.542562 -0.179995 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.502905 -0.245375 0.005)
(0.508707 -0.236119 0.005)
(0.514489 -0.22685 0.005)
(0.520235 -0.217558 0.005)
(0.525931 -0.208235 0.005)
(0.531561 -0.198873 0.005)
(0.537111 -0.189462 0.005)
(0.542562 -0.179995 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
