case3/TemplateCase-0.1/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.492852
-0.472736
-0.452619
-0.432503
-0.412386
-0.39227
-0.372154
-0.352037
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.502905
-0.508707
-0.514489
-0.520235
-0.525931
-0.531561
-0.537111
-0.542562
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.502905
0.508707
0.514489
0.520235
0.525931
0.531561
0.537111
0.542562
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
